## 8. 데이터 로딩과 저장

In [2]:
import pandas as pd
import numpy as np

In [16]:
!ls examples

'ls'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [10]:
df = pd.read_csv('./examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
df.columns

Index(['a', 'b', 'c', 'd', 'message'], dtype='object')

In [17]:
pd.read_table('./examples/ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
pd.read_csv('./examples/ex2.csv', header = None)  # 1행을 header로 가져오는 것이 default인데, 이것을 해체시킴

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [25]:
df = pd.read_csv('./examples/ex2.csv', names = ['a', 'b', 'c', 'd', 'message'])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
names = ['a', 'b', 'c', 'd', 'message']
df = pd.read_csv('./examples/ex2.csv', names = names)
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
df.set_index('message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [28]:
df.reset_index()

   index  a   b   c   d message
0      0  1   2   3   4   hello
1      1  5   6   7   8   world
2      2  9  10  11  12     foo

In [29]:
names = ['a', 'b', 'c', 'd', 'message']
df = pd.read_csv('./examples/ex2.csv', names = names, index_col = 'message')   # 인덱스 이름 동시설정
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [30]:
names = ['a', 'b', 'c', 'd', 'message']
df = pd.read_csv('./examples/ex2.csv', names = names, index_col = 4)   # 인덱스 숫자로 지정
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [41]:
df = pd.read_table('./examples/ex3.txt', sep = '\s+')   # 공백 1개 이상의 패턴과 매치시킴
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [42]:
df = pd.read_csv('./examples/ex2.csv')
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [49]:
df.to_csv('./examples/out.csv', index = False)

In [50]:
pd.read_csv('./examples/out.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

## 9. 데이터 정제 및 준비

### 9.1 누락된 데이터 처리하기

- 결측치 골라내기

In [51]:
type(np.nan)

float

In [53]:
string_data = pd.Series(['abc', 'def', np.nan, 'ghi'])
string_data

0    abc
1    def
2    NaN
3    ghi
dtype: object

In [54]:
pd.isnull(string_data)

0    False
1    False
2     True
3    False
dtype: bool

In [55]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [56]:
type(None) # 파이썬의 Nonetype 자료형

NoneType

In [57]:
string_data = pd.Series(['abc', 'def', None, 'ghi'])
string_data

0     abc
1     def
2    None
3     ghi
dtype: object

In [58]:
string_data.isnull()  # None값도 null로 간주됨

0    False
1    False
2     True
3    False
dtype: bool

In [60]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [61]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [63]:
data[data.isnull()]  # boolean 색인

1   NaN
3   NaN
dtype: float64

In [64]:
# null인 행을 삭제하고 싶다면 null행의 인덱스를 구해서 drop 함수에 적용
data.drop([1, 3]) # null인 행을 삭제

0    1.0
2    3.5
4    7.0
dtype: float64

In [66]:
null_idx = data[data.isnull()].index
data.drop(null_idx, axis = 0)

0    1.0
2    3.5
4    7.0
dtype: float64

In [67]:
# dropna를 사용하면 null인 행을 삭제
data.dropna()  # 위의 과정을 이걸로 대체

0    1.0
2    3.5
4    7.0
dtype: float64

In [69]:
data = pd.DataFrame([[1.0, 6.5, 3.0],
                     [1.0, np.nan, np.nan],
                     [np.nan, np.nan, np.nan],
                     [np.nan, 6.0, 3.0]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [74]:
data.dropna()  # axis = 0으로 설정되어 있으므로 행을 삭제
               # how = 'any' 설정되어 있으므로 null이 하나라도 있으면 삭제

     0    1    2
0  1.0  6.5  3.0

In [73]:
data.dropna(how = 'any')

     0    1    2
0  1.0  6.5  3.0

In [75]:
data.dropna(how = 'all')  # 행을 삭제하되, 그 행에 모든 값이 null인 행만 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

In [78]:
data[100] = np.nan
data

   0    1    2    100
0  1.0  6.5  3.0  NaN
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.0  3.0  NaN

In [81]:
data.dropna(axis = 1, how = 'all')  # 열을 삭제하되, 그 열의 모든 값이 null일 경우에 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [82]:
data.dropna(axis = 1, how = 'any') # 열을 삭제하되, 그 열의 값이 하나라도 null일 경우에 삭제

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [85]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.141825  1.069276  0.472887
1 -0.347908 -1.640724 -2.131715
2 -0.720441 -0.361517  0.728478
3 -1.997393  0.726908 -1.014408
4  1.074597  1.562239 -0.657711
5  0.445386 -0.024388  0.755625
6 -1.312274 -0.054971 -1.244348

In [89]:
df.iloc[0:4, 1] = np.nan
df.iloc[0:2, 2] = np.nan
df

          0         1         2
0  0.141825       NaN       NaN
1 -0.347908       NaN       NaN
2 -0.720441       NaN  0.728478
3 -1.997393       NaN -1.014408
4  1.074597  1.562239 -0.657711
5  0.445386 -0.024388  0.755625
6 -1.312274 -0.054971 -1.244348

In [91]:
df.dropna() # axis = 0, how = 'any'

          0         1         2
4  1.074597  1.562239 -0.657711
5  0.445386 -0.024388  0.755625
6 -1.312274 -0.054971 -1.244348

In [90]:
df.dropna(axis = 1)

          0
0  0.141825
1 -0.347908
2 -0.720441
3 -1.997393
4  1.074597
5  0.445386
6 -1.312274

In [92]:
df.dropna(axis = 1, thresh = 5) # thresh = 5: null이 아닌 데이터가 5개 미만인 데이터만 삭제하기

          0         2
0  0.141825       NaN
1 -0.347908       NaN
2 -0.720441  0.728478
3 -1.997393 -1.014408
4  1.074597 -0.657711
5  0.445386  0.755625
6 -1.312274 -1.244348

- 결측치 채우기

In [95]:
df.fillna(0)

          0         1         2
0  0.141825  0.000000  0.000000
1 -0.347908  0.000000  0.000000
2 -0.720441  0.000000  0.728478
3 -1.997393  0.000000 -1.014408
4  1.074597  1.562239 -0.657711
5  0.445386 -0.024388  0.755625
6 -1.312274 -0.054971 -1.244348

In [96]:
df.fillna({1:0, 2:0.5})  # dictionary를 이용해서 열마다 다른 값으로 대체

          0         1         2
0  0.141825  0.000000  0.500000
1 -0.347908  0.000000  0.500000
2 -0.720441  0.000000  0.728478
3 -1.997393  0.000000 -1.014408
4  1.074597  1.562239 -0.657711
5  0.445386 -0.024388  0.755625
6 -1.312274 -0.054971 -1.244348

In [98]:
df.fillna(0, inplace = True)
df

          0         1         2
0  0.141825  0.000000  0.000000
1 -0.347908  0.000000  0.000000
2 -0.720441  0.000000  0.728478
3 -1.997393  0.000000 -1.014408
4  1.074597  1.562239 -0.657711
5  0.445386 -0.024388  0.755625
6 -1.312274 -0.054971 -1.244348

In [100]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  1.172119  0.628043  0.170949
1 -0.651009 -1.094293  2.407846
2 -0.169237 -1.172606 -1.653468
3 -0.649842  0.981984 -0.569910
4  1.407762  0.253470 -0.061802
5 -1.613349 -0.953996  1.582535

In [103]:
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  1.172119  0.628043  0.170949
1 -0.651009 -1.094293  2.407846
2 -0.169237       NaN -1.653468
3 -0.649842       NaN -0.569910
4  1.407762       NaN       NaN
5 -1.613349       NaN       NaN

In [104]:
df.fillna(axis = 0, method = 'ffill')  # axis = 0이므로 "행축을 따라서" 채워넣기

          0         1         2
0  1.172119  0.628043  0.170949
1 -0.651009 -1.094293  2.407846
2 -0.169237 -1.094293 -1.653468
3 -0.649842 -1.094293 -0.569910
4  1.407762 -1.094293 -0.569910
5 -1.613349 -1.094293 -0.569910

In [105]:
df.fillna(axis = 1, method = 'ffill')  # axis = 0이므로 "열축을 따라서" 채워넣기

          0         1         2
0  1.172119  0.628043  0.170949
1 -0.651009 -1.094293  2.407846
2 -0.169237 -0.169237 -1.653468
3 -0.649842 -0.649842 -0.569910
4  1.407762  1.407762  1.407762
5 -1.613349 -1.613349 -1.613349

In [107]:
df.fillna(axis = 0, method = 'ffill', limit = 1)

          0         1         2
0  1.172119  0.628043  0.170949
1 -0.651009 -1.094293  2.407846
2 -0.169237 -1.094293 -1.653468
3 -0.649842       NaN -0.569910
4  1.407762       NaN -0.569910
5 -1.613349       NaN       NaN

In [111]:
m = df.mean(axis = 0).mean()  # 최종 평균
df.fillna(m)

          0         1         2
0  1.172119  0.628043  0.170949
1 -0.651009 -1.094293  2.407846
2 -0.169237 -0.076066 -1.653468
3 -0.649842 -0.076066 -0.569910
4  1.407762 -0.076066 -0.076066
5 -1.613349 -0.076066 -0.076066

### 9.2 데이터 변형

- 중복 제거하기

In [112]:
data = pd.DataFrame({'k1':['one', 'two']*3 + ['two'],
             'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [113]:
# 중복인지 체크
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [114]:
data.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [115]:
data.duplicated(keep='last')

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [116]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [119]:
# 중복인지 체크(k1 컬럼 기준으로)
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [121]:
# k1열 기준으로 삭제
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [122]:
data.drop_duplicates(['k1'], keep = 'last')

    k1  k2
4  one   3
6  two   4

In [124]:
data.duplicated(['k1'], keep = 'last')

0     True
1     True
2     True
3     True
4    False
5     True
6    False
dtype: bool

In [128]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [129]:
data.drop_duplicates()

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [130]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

- 값 치환하기

In [132]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [133]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [134]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [135]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [136]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

- 축 색인 이름 바꾸기

In [139]:
data =pd.DataFrame(np.arange(12).reshape(3, 4), index = ['Ohio', 'Colorado', 'New York'], columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [140]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [141]:
# option 1
def upper_tx(x):
    return x.upper()

data.index.map(upper_tx)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [142]:
# option 2
upper_tx = lambda x:x.upper()
data.index.map(upper_tx)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [143]:
# option 3
data.index.map(lambda x:x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [144]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [145]:
data.rename(index = {'Ohio':'Indiana'})

          one  two  three  four
Indiana     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [148]:
data.rename(index = str.upper)

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [149]:
data.rename(columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [150]:
data.rename(index = str.upper, columns = str.lower)

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [151]:
data.rename(index = str.upper, columns = str.title)

          One  Two  Three  Four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

- 벡터화된 문자열 함수

In [153]:
data = {'Dave':'dave@gmail.com',
        'Steve': 'steve@gmail.com',
        'Rob':'rob@gmail.com',
        'Wes':np.nan,
        'Puppy':'p',
        'Number':'123'}
sr_data= pd.Series(data)
sr_data

Dave       dave@gmail.com
Steve     steve@gmail.com
Rob         rob@gmail.com
Wes                   NaN
Puppy                   p
Number                123
dtype: object

In [154]:
sr_data.str.isnumeric()   # 숫자인지 물어봄

Dave      False
Steve     False
Rob       False
Wes         NaN
Puppy     False
Number     True
dtype: object

In [155]:
sr_data.str.isalpha()   # 알파벳인지 물어봄

Dave      False
Steve     False
Rob       False
Wes         NaN
Puppy      True
Number    False
dtype: object

In [156]:
sr_data.str.contains('gmail')  # 어떤 문자열이 들어있는지 물어봄

Dave       True
Steve      True
Rob        True
Wes         NaN
Puppy     False
Number    False
dtype: object

- 데이터 구간 분할

In [160]:
# 수치형 데이터(양적 데이터) -> 범주형 데이터(질적 데이터)
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [176]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins, labels = ["Youth", "YoungAdult", "MiddleAged", "Senior"])  # 가장 작은 값에서 큰 값까지 n등분

cats

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [177]:
pd.value_counts(cats)

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [179]:
cats = pd.cut(ages, 4)
pd.value_counts(cats)

(19.959, 30.25]    6
(30.25, 40.5]      3
(40.5, 50.75]      2
(50.75, 61.0]      1
dtype: int64

In [180]:
qcats = pd.qcut(ages, 4)  # quantile cut
pd.value_counts(qcats)

(19.999, 22.75]    3
(22.75, 29.0]      3
(29.0, 38.0]       3
(38.0, 61.0]       3
dtype: int64

- 특잇값(바깥값, outlier) 찾고 제외하기

In [181]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.015617     0.081176     0.016466    -0.011472
std       0.994170     0.987139     0.983634     0.977435
min      -3.403939    -3.419361    -2.620775    -2.983426
25%      -0.696948    -0.585405    -0.658108    -0.679775
50%      -0.048307     0.067688    -0.007493    -0.049311
75%       0.662005     0.755245     0.720655     0.649913
max       2.825572     3.071149     3.359775     4.084407

In [182]:
# 3보다 큰 값을 특이값(바깥값, outlier)로 가정하고, 해당되는 값을 3으로 치환
data > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [183]:
(data > 3).any(axis = 1) # 열축을 따라서 True값이 하나라도 있는지 확인

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [184]:
(data > 3).any(axis = 1).sum()

6

In [185]:
data[(data > 3).any(axis = 1)]

            0         1         2         3
16   0.360222  0.547164 -0.799526  3.201734
173 -0.486455  0.151039 -0.468833  3.289070
580 -0.440848  3.071149  2.189251  0.357819
648  2.116043  0.397031 -1.855894  3.056247
673  0.032446 -0.199079  1.132900  4.084407
989  1.016586  1.354094  3.359775  0.146256

In [186]:
data[data>3] = 3

In [187]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.015617     0.081105     0.016106    -0.013103
std       0.994170     0.986926     0.982475     0.971718
min      -3.403939    -3.419361    -2.620775    -2.983426
25%      -0.696948    -0.585405    -0.658108    -0.679775
50%      -0.048307     0.067688    -0.007493    -0.049311
75%       0.662005     0.755245     0.720655     0.649913
max       2.825572     3.000000     3.000000     3.000000

- 더미변수 계산하기(one-hot encoding)

In [194]:
df = pd.DataFrame({'fruit':['apple', 'apple', 'pear', 'peach', 'pear'], 'data':range(5)})
df

   fruit  data
0  apple     0
1  apple     1
2   pear     2
3  peach     3
4   pear     4

In [198]:
dummies = pd.get_dummies(df['fruit'], prefix = 'fruit')
dummies

   fruit_apple  fruit_peach  fruit_pear
0            1            0           0
1            1            0           0
2            0            0           1
3            0            1           0
4            0            0           1

In [202]:
pd.concat([df[['data']], dummies], axis = 1)

   data  fruit_apple  fruit_peach  fruit_pear
0     0            1            0           0
1     1            1            0           0
2     2            0            0           1
3     3            0            1           0
4     4            0            0           1